tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jandedobbeleer/oh-my-posh"
tap "stripe/stripe-cli"
# Mozilla CA certificate store
brew "ca-certificates"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Assuan IPC Library
brew "libassuan"
# Library for command-line editing
brew "readline"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Theme for zsh
brew "powerlevel10k"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Write, edit, and chat about your code with AI
cask "cursor"
# Database manager for MySQL, PostgreSQL, SQL Server, MongoDB, SQLite and others
cask "dbgate"
# Voice and text chat software
cask "discord"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox@developer-edition"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Customizable timing of breaks
cask "time-out"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "antfu.theme-vitesse"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "chris-noring.node-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jock.svg"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "nextnav.nextnav"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quick-lint.quick-lint-js"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "riazxrazor.html-to-jsx"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voorjaar.windicss-intellisense"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
